## Task 1
<details><summary><b>A_conditioner.cpp</b></summary>
<p>

**Task**
В офисе, где работает программист Петр, установили кондиционер нового типа. Этот кондиционер отличается особой простотой в управлении. У кондиционера есть всего лишь два управляемых параметра: желаемая температура и режим работы.

Кондиционер может работать в следующих четырех режимах:

* `«freeze»` — охлаждение. В этом режиме кондиционер может только уменьшать температуру. Если температура в комнате и так не больше желаемой, то он выключается.

* `«heat»` — нагрев. В этом режиме кондиционер может только увеличивать температуру. Если температура в комнате и так не меньше желаемой, то он выключается.

* `«auto»` — автоматический режим. В этом режиме кондиционер может как увеличивать, так и уменьшать температуру в комнате до желаемой.

* `«fan»` — вентиляция. В этом режиме кондиционер осуществляет только вентиляцию воздуха и не изменяет температуру в комнате.

Кондиционер достаточно мощный, поэтому при настройке на правильный режим работы он за час доводит температуру в комнате до желаемой.

Требуется написать программу, которая по заданной температуре в комнате `troom`, установленным на кондиционере желаемой температуре `tcond` и режиму работы определяет температуру, которая установится в комнате через час.

**Формат ввода**
Первая строка входного файла содержит два целых числа troom, и tcond, разделенных ровно одним пробелом *(–50 ≤ troom ≤ 50, –50 ≤ tcond ≤ 50)*.

Вторая строка содержит одно слово, записанное строчными буквами латинского алфавита — режим работы кондиционера.

**Формат вывода**
Выходной файл должен содержать одно целое число — температуру, которая установится в комнате через час.

**Пример 1**
Ввод    | Вывод
------- |:-------:
10  20  |  20
heat    |  

**Пример 2**
Ввод    | Вывод
------- |:-------:
10  20  |  10
freeze  |  

**Решение**
```cpp
    #include <iostream>
    #include <string>

    using namespace std;

    int main(){
        int troom, tcond;
        string mode;
        cin >> troom >> tcond;
        cin >> mode;

        if (mode == "freeze") {
            cout << min(troom, tcond);
        }
        else if(mode == "heat"){
            cout << max(troom, tcond);
        }
        else if(mode == "auto"){
            cout << tcond;
        }
        else if(mode == "fan"){
            cout << troom;
        }
    }
```

</p>
</details>


<details><summary><b>B_triangle.cpp</b></summary>
<p>
**Task**

Ограничение времени	| 1 секунда
--------------------|:-------------------:
Ограничение памяти	| 64Mb
Ввод	стандартный | ввод или input.txt
Вывод	стандартный | вывод или output.txt

Даны три натуральных числа. Возможно ли построить треугольник с такими сторонами. Если это возможно, выведите строку YES, иначе выведите строку NO.

Треугольник — это три точки, не лежащие на одной прямой.

**Формат ввода**
Вводятся три натуральных числа.

**Формат вывода**
Выведите ответ на задачу.

**Пример 1**
Ввод    | Вывод
------- |:-------:
   3    |  YES
   4    |
   5    |  

**Пример 2**
Ввод    | Вывод
------- |:-------:
   4    |  NO
   5    |
   3    |   

**Решение**
```cpp
    #include <iostream>
    #include <string>

    using namespace std;

    int main(){
        int a, b, c;
        cin >> a >> b >> c;

        if(a < (b + c) && b < (a + c) && c < (b + a)){
            cout << "YES";
        }
        else{
            cout << "NO";
        }
    }
```

</p>
</details>