## Task 1
<details><summary><b>A_conditioner.cpp</b></summary>
<p>

**Task**
В офисе, где работает программист Петр, установили кондиционер нового типа. Этот кондиционер отличается особой простотой в управлении. У кондиционера есть всего лишь два управляемых параметра: желаемая температура и режим работы.

Кондиционер может работать в следующих четырех режимах:

* `«freeze»` — охлаждение. В этом режиме кондиционер может только уменьшать температуру. Если температура в комнате и так не больше желаемой, то он выключается.

* `«heat»` — нагрев. В этом режиме кондиционер может только увеличивать температуру. Если температура в комнате и так не меньше желаемой, то он выключается.

* `«auto»` — автоматический режим. В этом режиме кондиционер может как увеличивать, так и уменьшать температуру в комнате до желаемой.

* `«fan»` — вентиляция. В этом режиме кондиционер осуществляет только вентиляцию воздуха и не изменяет температуру в комнате.

Кондиционер достаточно мощный, поэтому при настройке на правильный режим работы он за час доводит температуру в комнате до желаемой.

Требуется написать программу, которая по заданной температуре в комнате `troom`, установленным на кондиционере желаемой температуре `tcond` и режиму работы определяет температуру, которая установится в комнате через час.

**Формат ввода**
Первая строка входного файла содержит два целых числа troom, и tcond, разделенных ровно одним пробелом *(–50 ≤ troom ≤ 50, –50 ≤ tcond ≤ 50)*.

Вторая строка содержит одно слово, записанное строчными буквами латинского алфавита — режим работы кондиционера.

**Формат вывода**
Выходной файл должен содержать одно целое число — температуру, которая установится в комнате через час.

**Пример 1**
Ввод    | Вывод
------- |:-------:
10  20  |  20
heat    |  

**Пример 2**
Ввод    | Вывод
------- |:-------:
10  20  |  10
freeze  |  

**Решение**
```cpp
    #include <iostream>
    #include <string>

    using namespace std;

    int main(){
        int troom, tcond;
        string mode;
        cin >> troom >> tcond;
        cin >> mode;

        if (mode == "freeze") {
            cout << min(troom, tcond);
        }
        else if(mode == "heat"){
            cout << max(troom, tcond);
        }
        else if(mode == "auto"){
            cout << tcond;
        }
        else if(mode == "fan"){
            cout << troom;
        }
    }
```

</p>
</details>


<details><summary><b>B_triangle.cpp</b></summary>
<p>

**Task**

Ограничение времени	| 1 секунда
--------------------|:-------------------:
Ограничение памяти	| 64Mb
Ввод	стандартный | ввод или input.txt
Вывод	стандартный | вывод или output.txt

Даны три натуральных числа. Возможно ли построить треугольник с такими сторонами. Если это возможно, выведите строку YES, иначе выведите строку NO.

Треугольник — это три точки, не лежащие на одной прямой.

**Формат ввода**
Вводятся три натуральных числа.

**Формат вывода**
Выведите ответ на задачу.

**Пример 1**
Ввод    | Вывод
------- |:-------:
   3    |  YES
   4    |
   5    |  

**Пример 2**
Ввод    | Вывод
------- |:-------:
   4    |  NO
   5    |
   3    |   

**Решение**
```cpp
    #include <iostream>
    #include <string>

    using namespace std;

    int main(){
        int a, b, c;
        cin >> a >> b >> c;

        if(a < (b + c) && b < (a + c) && c < (b + a)){
            cout << "YES";
        }
        else{
            cout << "NO";
        }
    }
```

</p>
</details>

<details><summary><b>C_phone_numbers.cpp</b></summary>
<p>

Ограничение времени	| 1 секунда
--------------------|:-------------------:
Ограничение памяти	| 64Mb
Ввод	стандартный | ввод или input.txt
Вывод	стандартный | вывод или output.txt

**Task**

Телефонные номера в адресной книге мобильного телефона имеют один из следующих форматов: `+7` `<код>` `<номер>`, `8` `<код>` `<номер>`, `<номер>`, где `<номер>` — это семь цифр, а `<код>` — это три цифры или три цифры в круглых скобках. 
Если код не указан, то считается, что он равен `495`. Кроме того, в записи телефонного номера может стоять знак `“-”` между любыми двумя цифрами (см. пример). 
На данный момент в адресной книге телефона Васи записано всего три телефонных номера, и он хочет записать туда еще один. Но он не может понять, не записан ли уже такой номер в телефонной книге. Помогите ему! Два телефонных номера совпадают, если у них равны коды и равны номера. Например, `+7(916)0123456` и `89160123456` — это один и тот же номер.

**Формат ввода**
В первой строке входных данных записан номер телефона, который Вася хочет добавить в адресную книгу своего телефона. В следующих трех строках записаны три номера телефонов, которые уже находятся в адресной книге телефона Васи. Гарантируется, что каждая из записей соответствует одному из трех приведенных в условии форматов.

**Формат вывода**
Для каждого телефонного номера в адресной книге выведите `YES` (заглавными буквами), если он совпадает с тем телефонным номером, который Вася хочет добавить в адресную книгу или `NO` (заглавными буквами) в противном случае.

**Пример 1**
Ввод              | Вывод
----------------- |:-------:
8(495)430-23-97   |  YES
+7-4-9-5-43-023-97|  YES
4-3-0-2-3-9-7     |  NO
8-495-430         |  

**Пример 2**
Ввод         | Вывод
------------ |:-------:
86406361642  |  NO
83341994118  |  YES
86406361642  |  NO
83341994118  |

**Пример 3**
Ввод          | Вывод
------------- |:-------:
+78047952807  |  YES
+78047952807  |  NO
+76147514928  |  YES
88047952807   |

**Решение**
```cpp
    #include <iostream>
    #include <string>
    #include <vector>

    using namespace std;

    string lead_to_standart(string s){
        string number = "";
        for(const auto x: s){
            if(x != '+' && x != '-' && x != '(' && x != ')'){
                number.push_back(x);
            }
        }
        // cout << number << endl;

        if(number.size() == 11){
            number.erase(0, 1);
        }
        if(number.size() == 7){
            number = "495" + number;
        }
        return number;
    }

    int main(){
        string found_number, number1, number2, number3;
        cin >> found_number >> number1 >> number2 >> number3;
        // string found_number = "8(495)430-23-97";
        // string number1 = "+7-4-9-5-43-023-97";
        // string number2 = "4-3-0-2-3-9-7";
        // string number3 = "8-495-430";

        found_number = lead_to_standart(found_number);
        // cout << found_number << endl;

        vector <string> numbers = {number1, number2, number3};
        
        for(int i = 0; i < numbers.size(); i++){
            numbers[i] = lead_to_standart(numbers[i]);

            // cout << numbers[i] << endl;

            if(numbers[i] == found_number){
                cout << "YES" << endl;
            }
            else{
                cout << "NO" << endl;
            }
        }
    }

```
</p>
</details>